Repository: papoirier/chroma-generic
Catalog: backup/chroma-*.po
Languages: fr

source: The baskets
fr: Les paniers

source: The felt is 100% recycled and is comprised of 80% post-consumption fibers and 20% regenerated polyester. It is proudly and entirely made in Québec.
fr: Le feutre est constitué de 80% de fibres post-consommation et 20% de polyester régénéré, le tout fièrement et entièrement fait au Québec.

source: is obtained by thoroughly sorting garments and without adding any dye. It is sold at a standard width of 6 feet
fr: est obtenue sans ajout de teinture, seulement grâce au tri minutieux des vêtements. Il est vendu à une largeur standard de 6 pieds

source: The color
fr: La couleur

source: The sample card
fr: La carte d’échantillons

source: Baskets
fr: Paniers

source: is obtained by thoroughly sorting garments and without adding any dye. It is sold at a standard width of 6 feet
fr: est obtenue sans ajout de teinture, seulement grâce au tri minutieux des vêtements.

source: The color
fr: La couleur

source: It is sold at a standard width of
fr: Il est vendu à une largeur standard de

source: The felt is 100% recycled and made from 80% post-consumption fibers and 20% regenerated polyester. Proudly and entirely made in Québec.
fr: Le feutre est 100% recyclé et constitué de 80% de fibres post-consommation et 20% de polyester régénéré, le tout fièrement et entièrement fait au Québec.

source: The felt comes at a standard width of
fr: Le feutre est vendu à une largeur standard de

source: Login
fr: Connexion

source: My Account
fr: Mon compte

source: Cart
fr: Panier

source: Cart
fr: Panier

source: Specifications
fr: Spécifications

source: The sample
fr: L’échantillon

source: CO&SO baskets
fr: Paniers CO&SO

source: The felts
fr: Les feutres

source: Connect
fr: Relier

source: <span class="sc">CO&SO</span> products
fr: Produits <span class="sc">CO&SO</span>

source: Discover
fr: Découvrir

source: Language
fr: Langage

source: Subscribe
fr: S’inscrire

source: Website
fr: Site web

source: Company
fr: Compagnie

source: Last Name
fr: Nom de famille

source: First Name
fr: Prénom

source: Email *
fr: Courriel *

source: Chroma felts
fr: Feutres Chroma

source: Go home!
fr: Allez à la maison !

source: Clearly, the page you trying to reach does not exist nor ever has.
fr: Clairement que la page que vous tentez de joindre n'existe pas et — je dirais même plus — n'a jamais existé.

source: Error 404 - Page not found!
fr: Erreur 404 — page non trouvée !

source: Quantity
fr: Quantité

source: Go back to the homepage
fr: Retournez à la page d'accueil

source: Register
fr: Connexion
